mikeakohn/naken_asm/include/8051/stc8fxx.inc
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; STC8Axx/STC8Fxx include
;; part of the naken_asm assembler
;;
;; Generated by: Cjacker Huang (cjacker@gmail.com)
;;         Date: 2022-05-21
;;        Parts: STC8Axx / STC8Fxx
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

TA equ 0xae
DPS equ 0xe3
DPL1 equ 0xe4
DPH1 equ 0xe5
P0M0 equ 0x94
P0M1 equ 0x93
P1M0 equ 0x92
P1M1 equ 0x91
P2M0 equ 0x96
P2M1 equ 0x95
P3M0 equ 0xb2
P3M1 equ 0xb1
P4M0 equ 0xb4
P4M1 equ 0xb3
P5M0 equ 0xca
P5M1 equ 0xc9
P6M0 equ 0xcc
P6M1 equ 0xcb
P7M0 equ 0xe2
P7M1 equ 0xe1
AUXR2 equ 0x97
BUS_SPEED equ 0xa1
P_SW1 equ 0xa2
P_SW2 equ 0xba
VOCTRL equ 0xbb
RSTCFG equ 0xff
IE2 equ 0xaf
IP2 equ 0xb5
IPH equ 0xb7
IP2H equ 0xb6
INTCLKO equ 0x8f
AUXINTIF equ 0xef
T4T3M equ 0xd1
T4H equ 0xd2
T4L equ 0xd3
T3H equ 0xd4
T3L equ 0xd5
T2H equ 0xd6
T2L equ 0xd7
TH4 equ 0xd2
TL4 equ 0xd3
TH3 equ 0xd4
TL3 equ 0xd5
TH2 equ 0xd6
TL2 equ 0xd7
WKTCL equ 0xaa
WKTCH equ 0xab
WDT_CONTR equ 0xc1
S2CON equ 0x9a
S2BUF equ 0x9b
S3CON equ 0xac
S3BUF equ 0xad
S4CON equ 0x84
S4BUF equ 0x85
SADDR equ 0xa9
SADEN equ 0xb9
ADC_CONTR equ 0xbc
ADC_RES equ 0xbd
ADC_RESL equ 0xbe
ADCCFG equ 0xde
SPSTAT equ 0xcd
SPCTL equ 0xce
SPDAT equ 0xcf
IAP_DATA equ 0xc2
IAP_ADDRH equ 0xc3
IAP_ADDRL equ 0xc4
IAP_CMD equ 0xc5
IAP_TRIG equ 0xc6
IAP_CONTR equ 0xc7
ISP_DATA equ 0xc2
ISP_ADDRH equ 0xc3
ISP_ADDRL equ 0xc4
ISP_CMD equ 0xc5
ISP_TRIG equ 0xc6
ISP_CONTR equ 0xc7
CMPCR1 equ 0xe6
CMPCR2 equ 0xe7
CCON equ 0xd8
CMOD equ 0xd9
CL equ 0xe9
CH equ 0xf9
CCAPM0 equ 0xda
CCAPM1 equ 0xdb
CCAPM2 equ 0xdc
CCAPM3 equ 0xdd
CCAP0L equ 0xea
CCAP1L equ 0xeb
CCAP2L equ 0xec
CCAP3L equ 0xed
CCAP0H equ 0xfa
CCAP1H equ 0xfb
CCAP2H equ 0xfc
CCAP3H equ 0xfd
PCA_PWM0 equ 0xf2
PCA_PWM1 equ 0xf3
PCA_PWM2 equ 0xf4
PCA_PWM3 equ 0xf5
PWMCFG equ 0xf1
PWMIF equ 0xf6
PWMFDCR equ 0xf7
PWMCR equ 0xfe

; bit aliases

CY equ 0xd0+7
AC equ 0xd0+6
F0 equ 0xd0+5
RS1 equ 0xd0+4
RS0 equ 0xd0+3
OV equ 0xd0+2
F1 equ 0xd0+1
P equ 0xd0+0
EA equ 0xa8+7
ELVD equ 0xa8+6
EADC equ 0xa8+5
ES equ 0xa8+4
ET1 equ 0xa8+3
EX1 equ 0xa8+2
ET0 equ 0xa8+1
EX0 equ 0xa8+0
PPCA equ 0xb8+7
PLVD equ 0xb8+6
PADC equ 0xb8+5
PS equ 0xb8+4
PT1 equ 0xb8+3
PX1 equ 0xb8+2
PT0 equ 0xb8+1
PX0 equ 0xb8+0
TF1 equ 0x88+7
TR1 equ 0x88+6
TF0 equ 0x88+5
TR0 equ 0x88+4
IE1 equ 0x88+3
IT1 equ 0x88+2
IE0 equ 0x88+1
IT0 equ 0x88+0
SM0 equ 0x98+7
SM1 equ 0x98+6
SM2 equ 0x98+5
REN equ 0x98+4
TB8 equ 0x98+3
RB8 equ 0x98+2
TI equ 0x98+1
RI equ 0x98+0
CF equ 0xd8+7
CR equ 0xd8+6
CCF3 equ 0xd8+3
CCF2 equ 0xd8+2
CCF1 equ 0xd8+1
CCF0 equ 0xd8+0

; xdata

P0PU equ 0xfe10
P1PU equ 0xfe11
P2PU equ 0xfe12
P3PU equ 0xfe13
P4PU equ 0xfe14
P5PU equ 0xfe15
P6PU equ 0xfe16
P7PU equ 0xfe17
P0NCS equ 0xfe18
P1NCS equ 0xfe19
P2NCS equ 0xfe1a
P3NCS equ 0xfe1b
P4NCS equ 0xfe1c
P5NCS equ 0xfe1d
P6NCS equ 0xfe1e
P7NCS equ 0xfe1f
CKSEL equ 0xfe00
CLKDIV equ 0xfe01
IRC24MCR equ 0xfe02
XOSCCR equ 0xfe03
IRC32KCR equ 0xfe04
PWMC equ 0xfff0
PWMCH equ 0xfff0
PWMCL equ 0xfff1
PWMCKS equ 0xfff2
TADCP equ 0xfff3
TADCPH equ 0xfff3
TADCPL equ 0xfff4
PWM0T1 equ 0xff00
PWM0T1H equ 0xff00
PWM0T1L equ 0xff01
PWM0T2 equ 0xff02
PWM0T2H equ 0xff02
PWM0T2L equ 0xff03
PWM0CR equ 0xff04
PWM0HLD equ 0xff05
PWM1T1 equ 0xff10
PWM1T1H equ 0xff10
PWM1T1L equ 0xff11
PWM1T2 equ 0xff12
PWM1T2H equ 0xff12
PWM1T2L equ 0xff13
PWM1CR equ 0xff14
PWM1HLD equ 0xff15
PWM2T1 equ 0xff20
PWM2T1H equ 0xff20
PWM2T1L equ 0xff21
PWM2T2 equ 0xff22
PWM2T2H equ 0xff22
PWM2T2L equ 0xff23
PWM2CR equ 0xff24
PWM2HLD equ 0xff25
PWM3T1 equ 0xff30
PWM3T1H equ 0xff30
PWM3T1L equ 0xff31
PWM3T2 equ 0xff32
PWM3T2H equ 0xff32
PWM3T2L equ 0xff33
PWM3CR equ 0xff34
PWM3HLD equ 0xff35
PWM4T1 equ 0xff40
PWM4T1H equ 0xff40
PWM4T1L equ 0xff41
PWM4T2 equ 0xff42
PWM4T2H equ 0xff42
PWM4T2L equ 0xff43
PWM4CR equ 0xff44
PWM4HLD equ 0xff45
PWM5T1 equ 0xff50
PWM5T1H equ 0xff50
PWM5T1L equ 0xff51
PWM5T2 equ 0xff52
PWM5T2H equ 0xff52
PWM5T2L equ 0xff53
PWM5CR equ 0xff54
PWM5HLD equ 0xff55
PWM6T1 equ 0xff60
PWM6T1H equ 0xff60
PWM6T1L equ 0xff61
PWM6T2 equ 0xff62
PWM6T2H equ 0xff62
PWM6T2L equ 0xff63
PWM6CR equ 0xff64
PWM6HLD equ 0xff65
PWM7T1 equ 0xff70
PWM7T1H equ 0xff70
PWM7T1L equ 0xff71
PWM7T2 equ 0xff72
PWM7T2H equ 0xff72
PWM7T2L equ 0xff73
PWM7CR equ 0xff74
PWM7HLD equ 0xff75
I2CCFG equ 0xfe80
I2CMSCR equ 0xfe81
I2CMSST equ 0xfe82
I2CSLCR equ 0xfe83
I2CSLST equ 0xfe84
I2CSLADR equ 0xfe85
I2CTXD equ 0xfe86
I2CRXD equ 0xfe87
